#include <stdio.h>

/****************************************************************
 *  函数名称：语句表达式
 *  创建日期：2022-01-27 16:21:14
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
void test01()
{ 
	int sum;
	sum = 
	({
		int s;
		for(int i = 0; i < 10; i++)
		{
			s = s + i;
		}
		s;
	});

	printf("%d\n", sum);
	printf("---------------------------\n");
}

/****************************************************************
 *  函数名称：宏定义中的语句表达式
 *  创建日期：2022-01-27 16:22:24
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
#define MAX(x, y)                                                              \
  ({                                                                           \
    int _x = x;                                                                \
    int _y = y;                                                                \
    _x > _y ? _x: _y;                                                          \
  })

//对于其它类型的数据的扩展
#define MAX_1(type, x, y)                                                      \
  ({                                                                           \
    type _x = x;                                                               \
    type _y = y;                                                               \
    _x > _y ? x : y;                                                           \
  })

//Linux内核中的扩展
#define min_t(type, x, y)                                                      \
  ({                                                                           \
    type __min1 = (x);                                                         \
    type __min2 = (y);                                                         \
    __min1 < __min2 ? __min1 : __min2;                                         \
  })

#define max_t(type, x, y)                                                      \
  ({                                                                           \
    type __max1 = (x);                                                         \
    type __max2 = (y);                                                         \
    __max1 > __max2 ? __max1 : __max2;                                         \
  })

void test02()
{
	int a = 8 + MAX(1 + 1, 2 * 2);
	int b = 8 + MAX_1(int, 1 + 1, 2 * 2);

	printf("%d, %d\n", a, b);
	printf("---------------------------\n");
}

int main()
{
	test01();
    test02();
}
