#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <time.h>
#include "gameCompany1.h"


//初始化游戏                      玩家指针        玩家姓名
typedef void(*INIT_GAME)(vooid ** player, char * name);

//副本战斗 返回战斗是否胜利 1胜利 0失败 玩家     副本难度
typedef int(*FIGHT_GAME)(void * player, int gameDiff);

//打印玩家信息
typedef void(*PRINTF_GAME)(void * player);

//离开游戏
typedef void(*EXIT_GAME)(void * player);

/****************************************************************
 *  函数名称：
 *  创建日期：2021-10-03 16:31:15
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/


/****************************************************************
 *  函数名称：
 *  创建日期：2021-10-03 16:31:15
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/


/****************************************************************
 *  函数名称：main
 *  创建日期：2021-10-03 16:31:15
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
int main()
{
   
   return 0;
}
