#include <stdio.h>
#include <string.h>
#include <stdlib.h>

struct Person
{
    char name[64];
    int age;
    int id;
    double score;
};

/****************************************************************
 *  函数名称：showPerson
 *  创建日期：2021-09-09 15:30:16
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
void showPerson(const struct Person *p)
{
    //variable 'p' declared const here
    //p->age = 15;
    printf("姓名 ：%s\n年龄 ：%d\n学号 ：%d\n分数 ：%f\n", p->name, p->age, p->id, p->score);
}

/****************************************************************
 *  函数名称：test01
 *  创建日期：2021-09-09 15:30:16
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
void test01()
{
    struct Person p = {"Tom", 14, 12312, 75.6};
    showPerson(&p);
}

/****************************************************************
 *  函数名称：main
 *  创建日期：2021-09-09 15:30:16
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
int main()
{
   test01();
   return 0;
}
