#include <stdio.h>
#include <string.h>
#include <stdlib.h>

/*二级指针输入特性*/

/****************************************************************
 *  printArray1
 *  创建日期：2021-09-09 15:50:13
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
void printArray1(int **pArray, int len)
{
    for (int i = 0; i < len; i++)
    {
        printf("%d\n", *pArray[i]);
    }
}

/****************************************************************
 *  函数名称：test01
 *  创建日期：2021-09-09 15:50:13
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
void test01()
{
    //创建在堆区
    int **pArray = malloc(sizeof(int *) * 5);

    //在栈上创建5个数据
    int a1 = 10;
    int a2 = 20;
    int a3 = 30;
    int a4 = 40;
    int a5 = 50;

    pArray[0] = &a1;
    pArray[1] = &a2;
    pArray[2] = &a3;
    pArray[3] = &a4;
    pArray[4] = &a5;

    //打印数组
    printArray1(pArray, 5);

    //释放堆区数据
    if (pArray != NULL)
    {
        free(pArray);
        pArray = NULL;
    }
}

/****************************************************************
 *  函数名称：freeSpace1
 *  创建日期：2021-09-09 15:56:41
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
void freeSpace1(int **pArry, int len)
{
    for (int i = 0; i < len; i++)
    {
        free(pArry[i]);
        pArry[i] = NULL;
    }
}

/****************************************************************
 *  函数名称：test02
 *  创建日期：2021-09-09 16:09:40
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
void test02()
{
    //创建在栈区
    int *pArray[5];
    for (int i = 0; i < 5; i++)
    {
        pArray[i] = malloc(sizeof(int));
        *pArray[i] = i;
    }
    printArray1(pArray, 5);
}

/*二级指针输出特性*/

/****************************************************************
 *  函数名称：allocateSpace
 *  创建日期：2021-09-09 16:51:42
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
void allocateSpace(int **p)
{
    int *temp = malloc(sizeof(int) * 10); //有指针变量时尽量先搞一个temp变量
    memset(temp, 0, sizeof(int) * 10);
    for (int i = 0; i < 10; i++)
    {
        temp[i] = 100 + i;
    }
    *p = temp;
}

/****************************************************************
 *  printArray2
 *  创建日期：2021-09-09 15:50:13
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
void printArray2(int **pArray, int len)
{
    for (int i = 0; i < len; i++)
    {
        printf("%d\n", (*pArray)[i]);
    }
}

/****************************************************************
 *  函数名称：freeSpace2
 *  创建日期：2021-09-09 15:56:41
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
void freeSpace2(int **pArry, int len)
{
    if((*pArry) != NULL)
    {
        free(*pArry);
        *pArry = NULL;
    }
}


/****************************************************************
 *  函数名称：test03
 *  创建日期：2021-09-09 17:02:18
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
void test03()
{
    int *p = NULL;
    allocateSpace(&p);

    printArray2(&p, 5);

    freeSpace2(&p, 5);

    if (p == NULL)
    {
        printf("空指针\n");
    }
    else
    {
        printf("野指针\n");
    }
}

/****************************************************************
 *  函数名称：main
 *  创建日期：2021-09-09 15:50:13
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
int main()
{
    /*二级指针输入特性*/ //传入同级指针
    //test01();

    //test02();

    /*二级指针输出特性*/ //传入高级指针
    test03();

    return 0;
}
