#include <stdio.h>
#include <string.h>
#include <stdlib.h>

/****************************************************************
 *  函数名称：
 *  创建日期：2021-09-30 17:15:14
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
void test01()
{
    //可读性高
    int arr[3][3] = {
        {1, 2, 3},
        {4, 5, 6},
        {7, 8, 9}};

    int arr2[3][3] = {1, 2, 3, 4, 5, 6, 7, 8, 9};
    int arr3[][3] = {1, 2, 3, 4, 5, 6, 7, 8, 9};

    //二维数组名是不是指向第一个一维数组的 数组指针？

    //二维数组名称是指向第一个一维数组的 数组指针
    //两种情况除外
    //特殊情况1：sizeof
    //特殊情况2：对数组名取地址 &arr 获取的是二维数组的数组指针 int (*p)[3][3] = &arr
    
    printf("%d\n", arr);
    //warning: format specifies type 'int' but the argument has type
    //'int (*)[3]' [-Wformat] printf("%d\n", &arr);

    int (*pArray)[3] = arr;
    printf("%d\n", arr[1][2]);
    
    printf("%d\n", (*(pArray + 1))[2] );

    printf("%d\n", *(*(pArray + 1) + 2));
    //pArray是一个数组指针 pArray + 1 跳过了一个数组 也就到了{4, 5, 6}位置
    //*(pArray + 1) 就是数组名本身， 此时一维数组名是指向第一个元素的指针
    // 数组的元素步长是int类型， + 2 代表外后挪了两个位置
}

/****************************************************************
 *  函数名称：
 *  创建日期：2021-09-30 17:15:14
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
//void printArray(int (*array)[3], int row, int col)
//void printArray(int array[][3], int row, int col))
void printArray(int array[3][3], int row, int col) //array[3][3] 等价于 一维数组指针 int(*array)[3]
{
    for (int i = 0; i < row; i++)
    {
        for(int j = 0; j < col; j++)
        {
            printf("%d ", *(*(array + i) + j));
        }
        printf("\n");
    }
}

/****************************************************************
 *  函数名称：
 *  创建日期：2021-09-30 18:09:05
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
void test02()
{
    int arr[3][3] = {
        {1, 2, 3},
        {4, 5, 6},
        {7, 8, 9}};
    printArray(arr, 3, 3);
}

/****************************************************************
 *  函数名称：main
 *  创建日期：2021-09-30 17:15:14
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
int main()
{
    //test01();

    test02();

    return 0;
}
