#include <stdio.h>
#include <string.h>
#include <stdlib.h>

/****************************************************************
 *  函数名称：printArray
 *  创建日期：2021-09-27 20:11:58
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
//int arr[]可读性更高
void printArray(int arr[], int len)
{
    for (int i = 0; i < len; i++)
    {
        printf("arr[%d] = %4d, len = %4d, sizeof(int) = %4d\n", i, arr[i], len, sizeof(int));
    }
}


/****************************************************************
 *  函数名称：main
 *  创建日期：2021-09-27 20:11:58
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
int main()
{
    int arr[] = {1, 2, 3, 4, 5};
    printArray(arr, sizeof(arr) / sizeof(int));
    //一维数组名是不是指向第一个元素的指针？
    //有两种特殊情况，一维数组名不是指向第一个元素的指针
    //1、sizeof
    //2、对数组名取地址，得到的是数组指针，步长是整个数组长度
    printf("%d\n", arr);
    printf("%p\n", &arr);
    printf("%p\n", &arr + 1);
    
    //arr数组名 是一个指针常量， 指针的指向不可以修改，而指向的值可以改变
    arr[0] = 1000;
    
    //数组索引 可不可以为负数？  
    //可以
    int *p = arr;
    p = p + 3;

    printf("%d\n", p[-1]);      //给人看
    printf("%d\n", *(p - 1));   //机器看

    return 0;
}
