#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#pragma pack(show)
struct Teacher
{
    char a;
    int b;
};

/****************************************************************
 *  函数名称：
 *  创建日期：2021-10-01 14:17:36
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
void test01()
{
    struct Teacher t1;
    struct Teacher *p = &t1;
    printf("b的偏移量 %d\n", (int)&p->b - (int)p);
}

/****************************************************************
 *  函数名称：
 *  创建日期：2021-10-01 14:35:38
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
void test02()
{
    struct Teacher t1 = {'a', 123};
    printf("sizeof(t1) %d\n", sizeof(t1));
    printf("t1.b = %d\n", *(int *)((int *)&t1 + 1));
}

struct Teacher2
{
    char a;
    int b;
    struct Teacher c;
};

/****************************************************************
 *  函数名称：
 *  创建日期：2021-10-01 16:03:47
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
void test03()
{
    struct Teacher2 t1 = {'a', 34, 'b', 443};
    printf("sizeof(t1) %d\n", sizeof(t1));
    printf("c 的偏移量 %d\n", (int)(&(t1.c)) - (int)&t1);
}

/****************************************************************
 *  函数名称：main
 *  创建日期：2021-10-01 14:17:36
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
int main()
{
    // test01();

    // test02();

    test03();
    return 0;
}
