#include <stdio.h>
#include <string.h>
#include <stdlib.h>

/****************************************************************
 *  函数名称：
 *  创建日期：2021-10-03 16:04:28
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
//字符串递归实现字符串逆序遍历
void reversePrint(char *p)
{
    if (*p == '\0')
    {
        return;
    }

    reversePrint(p + 1);

    printf("%c\n", *p);
}

/****************************************************************
 *  函数名称：
 *  创建日期：2021-10-03 16:04:28
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
void test01()
{
    char *p = "hello world";

    reversePrint(p);
}

/****************************************************************
 *  函数名称：
 *  创建日期：2021-10-03 16:12:26
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
int fibonacci(int i)
{
    if (1 == i || 2 == i)
    {
        return 1;
    }

    return fibonacci(i - 1) + fibonacci(i - 2);
}

void test02()
{
    for(int i = 1; i < 20; i++)
    {
        printf("%d\n", fibonacci(i));
    }
}
/****************************************************************
 *  函数名称：main
 *  创建日期：2021-10-03 16:04:28
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
int main()
{
    //test01();
    test02();

    return 0;
}
