#include <stdio.h>
#include <string.h>
#include <stdlib.h>

/****************************************************************
 *  函数名称：//按位取反 ~
 *  创建日期：2021-09-27 15:12:00
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
void test01()
{
    int num = 2;
    printf("~num = %d\n", ~num);
}

/****************************************************************
 *  函数名称：//按位与 &
 *  创建日期：2021-09-27 15:12:00
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
void test02()
{
    int num = 123;
    if((num & 1) == 1)
    {
        printf("mum 是奇数\n");
    }
    else
    {
        printf("num 是偶数\n");
    }
    
}

/****************************************************************
 *  函数名称：//按位或 |
 *  创建日期：2021-09-27 15:26:30
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
void test03()
{
    int num1 = 5;
    int num2 = 3;
    printf("num1 | num2 = %d\n", num1 | num2);
}

/****************************************************************
 *  函数名称：//按位异或  ^
 *  创建日期：2021-09-27 15:31:08
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
void test04()
{
    int num1 = 5;
    int num2 = 9;
    printf("before : num1 %d, num2 %d\n", num1, num2);
    // num1 = num1 ^ num2;
    // num2 = num1 ^ num2;
    // num1 = num1 ^ num2;

    num1 = num1 + num2;
    num2 = num1 - num2;
    num1 = num1 - num2;

    printf("after : num1 %d, num2 %d\n", num1, num2);
}

/****************************************************************
 *  函数名称：//左移运算 << 
 *  创建日期：2021-09-27 15:38:43
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
void test05()
{
    int num = 20;
    printf("%d\n", num << 2);
}

/****************************************************************
 *  函数名称：//右移运算 >>
 *  创建日期：2021-09-27 15:38:45
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
void test06()
{
    int num = 20;
    printf("%d\n", num >> 2);
}

/****************************************************************
 *  函数名称：main
 *  创建日期：2021-09-27 15:12:00
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
int main()
{
    //test01(); 
    //test02();
    //test03();
    //test04();
    
    test05();
    test06();
    
    return 0;
}
