#include <stdio.h>
#include <string.h>
#include <stdlib.h>

/****************************************************************
 *  函数名称：
 *  创建日期：2021-10-01 21:51:51
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/

//注意事项1	不要用feof 按照字符方式读文件，原因有滞后性，会读出EOF
void test01()
{
   FILE * fp = fopen("test", "r");
   if(NULL == fp)
   {
      return;
   }
   char ch;

   while (!feof(fp))
   {
      ch = fgetc(fp);

      // if(feof(fp))
      // {
      //    break;
      // }

      printf("%c", ch);
   }

   printf("\n");
}

//注意事项2
struct Hero
{
   char * name;  //如果将属性开辟到堆区， 不要寸指针到文件中，要将指针指向的内容存到文件中
   int age;
};


/****************************************************************
 *  函数名称：main
 *  创建日期：2021-10-01 21:51:51
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
int main()
{
   test01();
   // printf(" aaaaa\n");
   // printf("%caaaaa\n",EOF);

   return 0;
}
