#include <stdio.h>

/****************************************************************
 *  函数名称：typeof
 *  创建日期：2022-01-27 17:01:22
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
int f()
{

}

void test01()
{
	int i;
	typeof(i) j = 20;
	typeof(int *) a;
	typeof(f()) k;
}

/****************************************************************
 *  函数名称：
 *  创建日期：2022-01-27 17:07:03
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
void test02()
{
	int i = 2;
	typeof(i) k = 6;

	int *p = &k;
	typeof(p) q = &i;

	printf("i = %d\n", i);
	printf("k = %d\n", k);
	printf("*p = %d\n", *p);
	printf("*q = %d\n", *q);
	printf("---------------------------\n");
}

/****************************************************************
 *  函数名称：继续完善MAX宏
 *  创建日期：2022-01-27 17:16:41
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
#define MAX(x, y)                                                              \
  ({                                                                           \
    typeof(x) _x = x;                                                          \
    typeof(x) _y = y;                                                          \
    _x > _y ? _x : _y;                                                           \
  })

void test03()
{
	int b = 8 + MAX(1 + 1, 2 * 2);

	printf("%d\n", b);
	printf("---------------------------\n");
}

/****************************************************************
 *  函数名称：内核中的使用
 *  创建日期：2022-01-27 17:24:26
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
#define min(x, y)                                                              \
  ({                                                                           \
    typeof(x) _min1 = (x);                                                     \
    typeof(y) _min2 = (y);                                                     \
    (void)(&_min1 == &_min2);                                                  \
    _min1 < _min2 ? _min1 : _min2;                                             \
  })

#define max(x, y)                                                              \
  ({                                                                           \
    typeof(x) _max1 = (x);                                                     \
    typeof(y) _max2 = (y);                                                     \
    (void)(&_max1 == &_max2);                                                  \
    _max1 > _max2 ? _max1 : _max2;                                             \
  })

//侧搜内核宏的健壮性
void test04()
{
	int a = 4;
	float b = 5.6;
	float c = max(a, b);
	printf("%f\n", c);
	printf("---------------------------\n");
}

int main()
{
	test01();
	test02();
	test03();
	test04();
}