#include <stdio.h>
#include <string.h>
#include <stdlib.h>

/****************************************************************
 *  函数名称：变长数组
 *  创建日期：2022-01-27 18:33:39
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
void test01()
{
	int len;
	int a[len];
	printf("---------------------------\n");
}

/****************************************************************
 *  函数名称：零长数组大小
 *  创建日期：2022-01-27 18:33:58
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
void test02()
{
	int buffer[0];
	printf("%lu\n", sizeof(buffer));
	printf("---------------------------\n");
}

/****************************************************************
 *  函数名称：零长数组在变长结构体中的使用
 *  创建日期：2022-01-27 18:34:24
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
 ******************************************************************/
void test03()
{
	struct buffer
	{
		int len;
		char buf[0];
	};
	printf("%lu\n", sizeof(struct buffer));

	struct buffer * buffer1;
	buffer1 = (struct buffer *)malloc(sizeof(struct buffer) + 20);
	buffer1->len = 20;
	strcpy(buffer1->buf, "Hello World!");
	puts(buffer1->buf);
	printf("---------------------------\n");
}

/****************************************************************
 *  函数名称：结构体中使用指针与零长数组
 *  创建日期：2022-01-28 10:58:14
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
void test04()
{
	struct buffer1
	{
		int len;
		char buf[0];
	};

	struct buffer2
	{
		int len;
		char * buf;
	};

	printf("sizeof(struct buffer1) = %d \n", sizeof(struct buffer1));
	printf("sizeof(struct buffer2) = %d \n", sizeof(struct buffer2));
	printf("---------------------------\n");
}

/****************************************************************
 *  函数名称：数组，零长数组与指针
 *  创建日期：2022-01-28 11:06:25
 *  作者：xujunze
 *  输入参数：无
 *  输出参数：无
 *  返回值：无
******************************************************************/
void test05()
{
	int array1[10] = {1,2,3,4,5,6,7,8,9};
	int array2[0];
	int *p = &array1[5];
}

int main()
{
	test01();
	test02();
	test03();
	test04();
	test05();
}